# **ERD_BOOKS**

![ERD_books](https://github.com/zyed79/Sales-Prediction-Project/assets/161171455/a01d334d-02d3-4ad3-a369-985737d4ebc5)

In [31]:
import pymysql
pymysql.install_as_MySQLdb()

In [32]:
from sqlalchemy import create_engine
import pandas as pd

In [47]:
# Create connection string using credentials following this format
username = "root"
password = "root" 
db_name = "books"
connection = f"mysql+pymysql://{username}:{password}@localhost/{db_name}"

In [48]:
engine = create_engine(connection)
conn = engine.connect()

In [49]:
q = """SHOW TABLES;"""
pd.read_sql(q, conn)

  Tables_in_books
0         authors
1           books
2       favorites
3           users

In [50]:
q = """SELECT * FROM books;"""
pd.read_sql(q, conn)

Empty DataFrame
Columns: [id, title, created_at, update_at, authors_id]
Index: []

In [41]:
q = """SELECT * FROM authors;"""
pd.read_sql(q, conn)

Empty DataFrame
Columns: [id, author_name]
Index: []

In [42]:
q = """SELECT * FROM users;"""
pd.read_sql(q, conn)

Empty DataFrame
Columns: [id, first name, last name, email]
Index: []

In [44]:
q = """SELECT * FROM favorites;"""
pd.read_sql(q, conn)

Empty DataFrame
Columns: [users_id, books_id]
Index: []

## **books**

In [55]:
df_books = pd.read_csv(r'C:\Users\user\OneDrive\Bureau\Books_folder\books.csv')
df_books

   id                 title  author_id
0   1           The Shining          1
1   2                    It          1
2   3      The Great Gatsby          2
3   4  The Call of the Wild          3
4   5   Pride and Prejudice          4
5   6          Frankenstein          5

In [56]:
df_books.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   id         6 non-null      int64
 1   title      6 non-null      object
 2   author_id  6 non-null      int64
dtypes: int64(2), object(1)
memory usage: 272.0+ bytes

In [57]:
q = '''DESCRIBE books;'''
describe = pd.read_sql(q, conn)
describe

,Field,Type,Null,Key,Default,Extra
0,id,int,NO,PRI,None,
1,title,varchar(45),NO,,None,
2,created_at,datetime,YES,,CURRENT_TIMESTAMP,DEFAULT_GENERATED
3,update_at,datetime,YES,,CURRENT_TIMESTAMP,DEFAULT_GENERATED on update CURRENT_TIMESTAMP
4,authors_id,int,NO,MUL,None,

In [58]:
# Checking describe's Field names
describe['Field'].values

array(['id', 'title', 'created_at', 'update_at', 'authors_id'],
      dtype=object)

In [59]:
# Checking dataframe's columns
df_books.columns

Index(['id', 'title', 'author_id'], dtype='object')

In [60]:
# Inserting Data into the books Table
df_books.to_sql("df_books",conn,index=False, if_exists='append')

6

In [61]:
# Checking the setting for FOREIGN_KEY_CHECKS
q = """SELECT @@FOREIGN_KEY_CHECKS"""
pd.read_sql(q, conn)

   @@FOREIGN_KEY_CHECKS
0                     1

In [63]:
# Changing the setting for FOREIGN_KEY_CHECKS with the connection
q = """SET @@FOREIGN_KEY_CHECKS=0"""
conn.execute(q)

In [64]:
# Confirm the checks are deactiavated
q = """SELECT @@FOREIGN_KEY_CHECKS"""
pd.read_sql(q,conn)

   @@FOREIGN_KEY_CHECKS
0                     0

In [72]:
# confirm the data has been added
q = """SELECT * FROM df_books;"""
pd.read_sql(q,conn)

    id                 title  author_id
0    1           The Shining          1
1    2                    It          1
2    3      The Great Gatsby          2
3    4  The Call of the Wild          3
4    5   Pride and Prejudice          4
5    6          Frankenstein          5
6    1           The Shining          1
7    2                    It          1
8    3      The Great Gatsby          2
9    4  The Call of the Wild          3
10   5   Pride and Prejudice          4
11   6          Frankenstein          5

In [70]:
# check the describe again to confirm no changes
q = """DESCRIBE df_books;"""
pd.read_sql(q,conn)

       Field    Type Null Key Default Extra
0         id  bigint  YES        None
1      title    text  YES        None
2  author_id  bigint  YES        None

In [80]:
df_books.dtypes

id            int64
title        object
author_id     int64
dtype: object

In [89]:
from sqlalchemy.types import VARCHAR, CHAR, DECIMAL, DATE, DATETIME, INT

In [90]:
df_books_dtypes = {'id':INT,
                    'title':VARCHAR(45),
                    'author_id':INT,
                    'created_at':DATETIME,
                    'updated_at':DATETIME}
df_books_dtypes

{'id': sqlalchemy.sql.sqltypes.INTEGER,
 'title': VARCHAR(length=45),
 'author_id': sqlalchemy.sql.sqltypes.INTEGER,
 'created_at': sqlalchemy.sql.sqltypes.DATETIME,
 'updated_at': sqlalchemy.sql.sqltypes.DATETIME}

In [91]:
# Changing if_exists to replace to demo consequences.
df_books.to_sql("df_books",conn, index=False, if_exists='replace',
                dtype=df_books_dtypes)
# Checking the describe again
q = """DESCRIBE df_books;"""
pd.read_sql(q,conn)

       Field         Type Null Key Default Extra
0         id          int  YES        None
1      title  varchar(45)  YES        None
2  author_id          int  YES        None

In [94]:
q = """ALTER TABLE df_books ADD created_at DATETIME DEFAULT NOW()"""
conn.execute(q)

In [95]:
q = """ALTER TABLE df_books ADD updated_at DATETIME DEFAULT NOW() ON UPDATE NOW();"""
conn.execute(q)

In [97]:
q = """SELECT * FROM df_books;"""
pd.read_sql(q,conn)

   id                 title  author_id          created_at          updated_at
0   1           The Shining          1 2024-05-15 18:15:46 2024-05-15 18:16:26
1   2                    It          1 2024-05-15 18:15:46 2024-05-15 18:16:26
2   3      The Great Gatsby          2 2024-05-15 18:15:46 2024-05-15 18:16:26
3   4  The Call of the Wild          3 2024-05-15 18:15:46 2024-05-15 18:16:26
4   5   Pride and Prejudice          4 2024-05-15 18:15:46 2024-05-15 18:16:26
5   6          Frankenstein          5 2024-05-15 18:15:46 2024-05-15 18:16:26

## **users**

In [98]:
df_users = pd.read_csv(r'C:\Users\user\OneDrive\Bureau\Books_folder\users.csv')
df_users

   id first_name  last_name                 email
0   1       John        Doe          JD@books.com
1   2      Robin      Smith       Robin@books.com
2   3     Gloria  Rodriguez  grodriquez@books.com

In [99]:
df_users.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   id          3 non-null      int64
 1   first_name  3 non-null      object
 2   last_name   3 non-null      object
 3   email       3 non-null      object
dtypes: int64(1), object(3)
memory usage: 224.0+ bytes

In [100]:
q = '''DESCRIBE users;'''
describe = pd.read_sql(q, conn)
describe

        Field         Type Null  Key Default Extra
0          id          int   NO  PRI    None
1  first name  varchar(45)   NO         None
2   last name  varchar(45)   NO         None
3       email  varchar(45)   NO         None

In [102]:
# Checking describe's Field names
describe['Field'].values

array(['id', 'first name', 'last name', 'email'], dtype=object)

In [104]:
# Checking dataframe's columns
df_users.columns

Index(['id', 'first_name', 'last_name', 'email'], dtype='object')

In [106]:
# Rename columns to match SQL table
rename_map = {"first_name":"first name",
             "last_name":"last name"}
df_users = df_users.rename(rename_map,axis=1)
df_users.head(2)

   id first name last name            email
0   1       John       Doe     JD@books.com
1   2      Robin     Smith  Robin@books.com

In [107]:
df_users.to_sql("df_users",conn,index=False, if_exists='append')

3

In [108]:
# confirm the data has been added
q = """SELECT * FROM df_users;"""
pd.read_sql(q,conn)

   id first name  last name                 email
0   1       John        Doe          JD@books.com
1   2      Robin      Smith       Robin@books.com
2   3     Gloria  Rodriguez  grodriquez@books.com

## **authors**

In [109]:
df_authors = pd.read_csv(r'C:\Users\user\OneDrive\Bureau\Books_folder\authors.csv')
df_authors

   id        author_name
0   1       Stephen King
1   2  F.Scott Fitgerald
2   3        Jack London
3   4        Jane Austen
4   5       Mary Shelley

In [110]:
df_authors.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 2 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   id           5 non-null      int64
 1   author_name  5 non-null      object
dtypes: int64(1), object(1)
memory usage: 208.0+ bytes

In [111]:
q = '''DESCRIBE authors;'''
describe = pd.read_sql(q, conn)
describe

         Field         Type Null  Key Default Extra
0           id          int   NO  PRI    None
1  author_name  varchar(45)   NO         None

In [112]:
# Checking describe's Field names
describe['Field'].values

array(['id', 'author_name'], dtype=object)

In [113]:
# Checking dataframe's columns
df_authors.columns

Index(['id', 'author_name'], dtype='object')

In [114]:
df_authors.to_sql("df_authors",conn,index=False, if_exists='append')

5

In [115]:
# confirm the data has been added
q = """SELECT * FROM df_authors;"""
pd.read_sql(q,conn)

   id        author_name
0   1       Stephen King
1   2  F.Scott Fitgerald
2   3        Jack London
3   4        Jane Austen
4   5       Mary Shelley

## **favorites**

In [116]:
df_favorites = pd.read_csv(r'C:\Users\user\OneDrive\Bureau\Books_folder\favorites.csv')
df_favorites

   user_id  book_id
0        1        1
1        1        2
2        1        3
3        2        4
4        2        5
5        3        5
6        3        6

In [117]:
q = '''DESCRIBE favorites;'''
describe = pd.read_sql(q, conn)
describe

      Field Type Null  Key Default Extra
0  users_id  int   NO  PRI    None
1  books_id  int   NO  PRI    None

In [118]:
# Checking describe's Field names
describe['Field'].values

array(['users_id', 'books_id'], dtype=object)

In [119]:
# Checking dataframe's columns
df_favorites.columns

Index(['user_id', 'book_id'], dtype='object')

In [121]:
# Rename columns to match SQL table
rename_map = {"user_id":"users_id",
             "book_id":"books_id"}
df_favorites = df_favorites.rename(rename_map,axis=1)
df_favorites.head(2)

   users_id  books_id
0         1         1
1         1         2

In [122]:
df_favorites.to_sql("df_favorites",conn,index=False, if_exists='append')

7

In [123]:
# confirm the data has been added
q = """SELECT * FROM df_favorites;"""
pd.read_sql(q,conn)

   users_id  books_id
0         1         1
1         1         2
2         1         3
3         2         4
4         2         5
5         3         5
6         3         6

In [124]:
q = """SHOW TABLES;"""
pd.read_sql(q, conn)

  Tables_in_books
0         authors
1           books
2      df_authors
3        df_books
4    df_favorites
5        df_users
6       favorites
7           users

In [125]:
SELECT books.title, favorites.user_id
FROM books
JOIN favorites ON books.id = favorites.book_id
WHERE favorites.user_id = 
    (SELECT users.id FROM users WHERE (users.last_name = "London" AND users.first_name = "Jack"));

SyntaxError: invalid syntax (1438927427.py, line 1)

In [126]:
# Closing the connection
conn.close()